from services.rag import rag_service
from services.ai_wrapper import execute_chat

rag_service.create_notebook("test")

rag_service.insert_data("test","""
Національне управління з аеронавтики і дослідження космічного простору (англ. National Aeronautics and Space Administration (NASA)) — агентство уряду США, засноване 1958 року для досліджень у галузі аеронавтики й космічних польотів. Штаб-квартира НАСА розташована у Вашингтоні; основний стартовий комплекс — на мисі Канаверал у Космічному центрі Кеннеді на Флориді. Перша космічна програма НАСА почалася в 1958 році з запуску космічного апарата «Експлорер», який збирав інформацію для подальших пілотованих польотів, найвідомішим з яких став політ на Місяць «Аполлона-11» 16—24 липня 1969 року.

Історія створення
НАСА було створене шляхом реорганізації американського Національного консультативного комітету з аеронавтики (англ. National Advisory Committee for Aeronautics або NACA), який з 1946 року займався дослідженнями в царині ракетобудування й розробив перший у світі надзвуковий літак Bell X-1. З початку 1950-х років це агентство перейшло до розробки штучних супутників Землі та проєктів, реалізація яких дозволила б їхнє успішне виведення на земну орбіту. Головним конкурентом США в освоєнні космічного простору тоді став СРСР, космічна програма якого розвивалася стрімкими темпами. При початках космічної ери питання дослідження космосу виходили з суто наукової площини й відігравали величезну роль у взаємовідносинах двох світових наддержав та балансу сили між ними.

Тоді було ухвалене рішення реорганізувати НАСА, створивши на базі нього управління з новими повноваженнями, в компетенцію якого входило б координування всіх американських мирних програм з освоєння космічного простору.

Таким чином, 29 липня 1958 року було створено Національне управління з аеронавтики і дослідження космічного простору або НАСА.

Американський астронавт NASA Дон Петтіт, перебуваючи борту Міжнародної космічної станції, зробив знімок Землі з висоти 400 км[15].

Як зазначається, світлину створили, коли орбітальна лабораторія проходила над територією Мексики та США.

На фото можна розгледіти вогні міст під МКС, а лівіше на знімку на горизонті – полярне сяйво. У тій частині планети енергетичні частинки від Сонця, що досягло піку активності, взаємодіють із верхніми шарами атмосфери.

Джерело: [15]

Найбільші космічні проєкти та програми
«Меркурій»
«Джеміні»
«Аполлон»
«Скайлеб»
Експериментальний політ «Союз — Аполлон»
"Спейс Шаттл"
«Сузір'я»
Міжнародна космічна станція
Commercial Resupply Services
Commercial Crew Development
«Меркурій»
«Меркурій»
Екіпаж	1 людина
Маса	1355 кг
Довжина	4,04 м
Максимальний діаметр	1,89 м
Житловий об'єм	1,7 м³
Тривалість польоту	1 доба
Ракети-носії	«Редстоун»
«Атлас»
Докладніше: Проєкт Меркурій
«Меркурій» (англ. Mercury) — перша пілотована космічна програма США. Через малу вантажопідйомність ракет-носіїв «Редстоун»[en] та «Атлас» можливості пілотованої капсули «Меркурій» були вкрай обмежені й поступались за технічними параметрами космічним кораблям «Восток». Тим не менш, у ході програми були ретельно відпрацьовані методи орієнтації корабля й отриманий значний технічний та медико-біологічний досвід, що використовувався в програмах «Джеміні» та «Аполлон». Окрім того, астронавти приземлялись (точніше, приводнювалися) в кабіні спускного апарата, а не катапультувались при посадці, як у кораблях «Восток». Кораблі «Меркурій» були значно менші та легші, ніж «Восток», гальмівний двигун був твердопаливним, космонавт брав у пілотуванні кораблем значно більшу участь, ніж на «Востоках» — останні були більше автоматизовані. Сумарний час пілотованих польотів за програмою склав більш як дві доби.

«Джеміні»
«Джеміні»
Екіпаж	2 людини
Маса	3851 кг
Довжина	5,67 м
Максимальний діаметр	3,05 м
Житловий об'єм	2,55 м³
Тривалість польоту	14 днів
Ракета-носій	Титан
Докладніше: Джеміні (космічна програма)
«Джеміні» (англ. Gemini) — космічна програма США. Космічні кораблі серії «Джеміні» продовжили серію кораблів «Меркурій», але значно переважали їх за можливостями (2 людини в екіпажі, більший час автономного польоту, можливість зміни параметрів орбіти та ін.). У ході програми були відпрацьовані методи зближення і стикування, вперше в історії здійснено стикування космічних апаратів. Було проведено кілька виходів у відкритий космос, встановлені рекорди тривалості космічного польоту. Сумарний час польотів по програмі склав понад 41 добу. Сумарний час виходів у відкритий космос склав 10 годин. Досвід, отриманий у ході програми Джеміні, був використаний при підготовці і здійсненні програми Аполлон.


Аерокосмічний центр ім. Кеннеді у Флориді
«Аполлон»
Докладніше: Космічна програма «Аполлон»
Програма Аполлон — програма пілотованих космічних польотів НАСА, прийнята в 1961 році з метою здійснення першої пілотованої висадки на Місяць і завершена в 1975 році. Президент Джон Ф. Кеннеді сформулював це завдання в своїй промові 12 вересня 1961 року, і вона була вирішена 20 липня 1969 року в ході місії «Аполлон-11» висадкою Ніла Армстронга і Базза Олдріна. Також за програмою «Аполлон» були здійснені ще 5 успішних висадок астронавтів на Місяць, остання в 1972 році. Ці шість польотів за програмою Аполлон на сьогодні єдині за всю історію людства, коли люди висаджувалися на іншому астрономічному об'єкті. Програма Аполлон і висадка на Місяць часто згадуються як найбільші досягнення в історії людства.

«Скайлеб»
Докладніше: Скайлеб
Скайлеб (англ. Skylab, від англ. sky laboratory — небесна лабораторія) — американська орбітальна станція, призначена для технологічних, астрофізичних, біолого-медичних досліджень, а також для спостереження Землі. Запущена 14 травня 1973 року, прийняла три експедиції з травня 1973 по лютий 1974 року, зійшла з орбіти і зруйнувалася 11 липня 1979 року.

Довжина 24,6 м, максимальний діаметр 6,6 м, маса — 77 т, внутрішній об'єм 352,4 м³. Висота орбіти 434—437 км (перигей — апогей), нахил 50°. Загалом на станції побували три експедиції. Основним завданням експедицій було вивчення адаптації людини до умов невагомості і проведення наукових експериментів.

Перша експедиція (Чарлз Конрад, Пол Вайц, Джозеф Кервін) протривала 28 діб (24.05.1973 — 22.06.1973) і мала не стільки науковий, скільки ремонтний характер. У ході декількох виходів у космос астронавти розкрили заклинену сонячну батарею і відновили терморегуляцію станції за допомогою встановленої теплозахисної «парасольки».

Друга експедиція в складі Алана Біна, Джека Лусми і Овена Герріотта вирушила на станцію 28.07.1973 і провела на орбіті вже 59 днів.

Третя і остання експедиція (Джералд Карр, Едвард Гібсон, Вільям Поуг) стартувала 16 листопада 1973 року і поставила абсолютний рекорд тривалості перебування людини в космосі — 84 дні.

«Союз — Аполлон» 

15 липня 1975 року. Ракета-носій «Saturn-1Б» виводить американський екіпаж на орбіту.
Докладніше: Союз — Аполлон

Експериментальний політ «Аполлон» — «Союз» (ЕПАС, або більш поширена назва програма «Союз» — «Аполлон»; англ. Apollo-Soyuz Test Project (ASTP)) — програма спільного експериментального польоту радянського космічного корабля «Союз-19» і американського космічного корабля «Аполлон».

Програма була затверджена 24 травня 1972 року Угодою між СРСР і США про співпрацю в дослідженні і використанні космічного простору в мирних цілях. Основними цілями програми були:

випробування елементів сумісної системи зближення на орбіті;
випробування активно-пасивних стикувальних агрегатів;
перевірка техніки та обладнання для забезпечення переходу космонавтів з корабля в корабель;
накопичення досвіду у проведенні спільних польотів космічних кораблів СРСР і США.
Спейс Шаттл

Space Shuttle «AtlantiS» заходить на посадку
Докладніше: "Спейс Шаттл" (програма)
Космічна транспортна система (англ. Space Transportation System), більш відома як «Спейс Шаттл» (від англ. Space shuttle — космічний човник) — американський багаторазовий транспортний космічний корабель. Шаттл запускався в космос за допомогою власних ракетних двигунів і твердопаливних прискорювачів, здійснював маневри на орбіті як космічний корабель і повертався на Землю як літак. Малося на увазі, що шаттли снуватимуть, як човники, між навколоземною орбітою і Землею, доправляючи корисні вантажі в обох напрямках. При розробці передбачалося, що кожен із шатлів повинен був до 100 разів стартувати в космос. На практиці ж всього було здійснено 135 стартів. До березня 2011 року найбільше польотів — 39 — здійснив шаттл «Діскавері». У ході програми зазнали катастроф 2 кораблі й загинули 14 астронавтів.

Міжнародна космічна станція (1993 рік — наші дні)
Докладніше: Міжнародна космічна станція

МКС, 2011 рік
Для розвитку приватних автоматизованих космічних кораблів (КК) НАСА започаткувало програму Commercial Resupply Services. Контракти щодо неї виграли дві компанії: Orbital ATK[en] (колишня Orbital Sciences) зі своїм КК Sygnus та SpaceX із КК Dragon. Наразі вони регулярно здійснюють постачання вантажів до і з МКС.

Завдяки програмі Commercial Crew Development компаніями SpaceX та Boeing були розроблені, а зараз випробовуються пілотовані КК CST-100 Starliner та Dragon 2. На серпень та грудень 2018 року заплановані їхні непілотовані (SpaceX DM-1) та пілотовані (SpaceX DM-2) місії до МКС.

У травні 2018 року НАСА відправляє на борт Міжнародної космічної станції наукову установку, в надрах якої буде створена область простору, в 10 мільярдів разів більш холодна, ніж космічний вакуум. Ця установка, Cold Atom Laboratory (CAL), є частиною вантажу ракети Cygnus компанії Orbital ATK, і вона дозволить вченим вивчати квантові властивості ультрахолодних атомів в умовах невагомості[16].

Дослідження Марса
Докладніше: Дослідження Марса
	
Цей розділ потребує доповнення. (серпень 2020)
У лютому 2018 року Національне космічне агентство США опублікувало панорамну зйомку Марса, зроблену за допомогою марсохода «К'юріосіті».

Дослідження Місяця та інших планет
Докладніше: Сервеєр, MESSENGER, Піонер (програма), Вояджер, Кассіні — Гюйгенс та New Horizons
	
Цей розділ потребує доповнення. (вересень 2020)
Космічні телескопи
Докладніше: Великі обсерваторії (NASA) та WMAP
	
Цей розділ потребує доповнення. (серпень 2020)
Інші проєкти
Докладніше: Астрофізична інформаційна система НАСА
	
Цей розділ потребує доповнення. (серпень 2020)
21 жовтня 2023 року Університет Берклі у Каліфорнії та відділення НАСА під назвою Дослідницький центр Еймса оголосили, що у Кремнієвій долині буде побудований космічний центр за 2 мільярди доларів, над створенням якого вчені працюють вже понад 20 років[17][18].

Наукові та науково-дослідні програми
Місія з дослідження невідомих аномальних явищ (UAP)
14 вересня 2023 року НАСА повідомило про призначення нового директора з дослідження невідомих аномальних явищ (UAP), які більш відомі громадськості, як НЛО. Згідно з повідомленням Reuters, Голова агентства також повідомив, що група експертів закликає детальніше з'ясувати факти цього явища та активізувати свої зусилля для збору інформації про UAP і відігравати більшу роль у допомозі Пентагону їх виявити[19][20]. Того ж дня, група вчених опублікувала звіт «Незалежне дослідження невстановлених аномальних явищ», що складається з 36 сторінок і містить низку рекомендацій щодо того, як НАСА може краще сприяти науковим дослідженням ситуацій під час зустрічей з НЛО. За словами представників НАСА, одним із завдань дослідження було найкраще забезпечення безпеки літаків у повітрі[21].

Місія PREFIRE
У серпні 2023 року НАСА вибрало Rocket Lab USA Inc. з Лонг-Біч, штат Каліфорнія (США), для надання послуг запуску місії агентства PREFIRE (Енергія полярного випромінювання в експерименті далекого інфрачервоного діапазону), яка має на меті дати дослідникам точнішу картину енергії, що надходить і залишаючи Землю. Місія PREFIRE допоможе усунути прогалину в розумінні того, скільки земного тепла втрачається в космос, особливо з Арктики та Антарктиди. Аналіз вимірювань PREFIRE дасть інформацію про моделі клімату та льоду, забезпечуючи кращі прогнози того, як потепління світу вплине на втрату морського льоду, танення крижаного покриву та підвищення рівня моря. Удосконалення кліматичних моделей може врешті-решт допомогти забезпечити точніші прогнози щодо впливу потужності та частоти штормів, а також берегової ерозії та повеней. Місія складається з двох 6U CubeSats з базовою тривалістю місії 10 місяців і спільно розроблена НАСА та Університетом Вісконсину в Медісоні. Лабораторія реактивного руху НАСА в Південній Каліфорнії керує місією для Управління наукових місій агентства та надає інструменти. Blue Canyon Technologies будує CubeSats, а Університет Вісконсіна-Медісон оброблятиме дані, зібрані приладами. До наукової групи входять члени JPL та університетів Вісконсіна, Мічигану та Колорадо[22][23].

NASA+
Згідно з повідомленням агентства НАСА, до кінця 2023 року буде створено безкоштовну стрімінгову платформу без реклами, яка незабаром буде доступна на iOS та Android. Новий проєкт має стати корисним джерелом інформації, що демонструватиме прямі трансляції подій, спеціальні панелі, ексклюзивні інтерв’ю та оригінальні відеосеріали. Доступ до нього буде забезпечено через застосунок НАСА не тільки на Android та iOS, а також в Інтернеті та за допомогою Roku, Apple TV і Fire TV[24].

Хакатони
В січні 2021 року команда розробників програмного забезпечення з України перемогла на міжнародному хакатоні NASA. За повідомленням NASA Space Apps Challenge, українці розробили універсальний космічний з'єднувач для дозаправки супутників на орбіті рідиною, газом та електроенергією. Коли паливо витрачено повністю, супутник не може утримувати орбіту і починає дрейфувати, втрачаючи зв'язок. Дозаправка дозволить продовжити життєвий цикл супутника, а компаніям і урядам - заощадити гроші на розробку і запуск нового космічного апарата[25].

В січні 2025 року команда розробників програмного забезпечення з України в черговий раз перемогла на міжнародному хакатоні NASA International Space Apps Challenge. У змаганнях взяли участь більш як 90 тисяч фахівців зі всього світу і близько 10 тисяч команд створили проєкти. Близько 1000 проєктів, зокрема й український, оцінювалися безпосередньо NASA. За підсумками хакатону, команда України — стала переможцем[26].

Збої в діяльності
25 липня 2023 року в результаті відключення електроенергії в штаб-квартирі НАСА в Х’юстоні, був тимчасово порушений зв’язок з МКС. Уперше з моменту запуску МКС у 2009 році космічному агентству довелося покладатися на свої резервні системи управління, щоб відновити зв’язок з астронавтами, які перебувають на борту в сотнях кілометрів над поверхнею Землі. Збій тривав близько 90 хвилин, перш ніж нормальний зв’язок вдалося відновити. Відключення, під час якого було втрачено телеметрію, голосовий зв’язок і управління, стало результатом планової модернізації наземної енергетичної системи будівлі в Космічному центрі імені Ліндона Джонсона, хоча саме відключення не було очікуваним. Водночас протягом 20 хвилин після відключення електроенергії центр управління польотами НАСА був на зв’язку з МКС через російські системи, а резервний центр управління, розташований за декілька миль від штаб-квартири, незабаром був підключений до мережі. Загалом проблема була вирішена, і управління місією знову почало повністю функціонувати. Однак НАСА має намір розслідувати інцидент і переконатися, що він не повториться в наступні роки експлуатації МКС[27].

Бюджет агентства
НАСА має найбільший бюджет серед усіх космічних агентств світу. З 1958 по 2008 роки НАСА витратила на космічні програми (з урахуванням інфляції) близько 810,5 млрд доларів[джерело?].

Бюджет у 2005 році становив близько 16,2 млрд дол.
Бюджет у 2007 році становив близько 17,4 млрд дол.
Бюджет у 2008 році становив близько 17,3 млрд дол.
Бюджет у 2009 році становив близько 17,6 млрд дол.
Бюджет у 2010 році становив близько 18,7 млрд дол.
Бюджет у 2011 році становив близько 19 млрд дол.
Бюджет у 2012 році становив близько 17,770 млрд дол.
Бюджет у 2013 році становив близько 17,711 млрд дол.
Бюджет у 2014 році становив близько 17,6 млрд дол.
Бюджет у 2015 році становив близько 18 млрд дол.
Бюджет у 2016 році становив близько 19,3 млрд дол.
Бюджет у 2017 році становив близько 19,5 млрд дол.
Бюджет у 2018 році пропонований близько 20 млрд дол.
Керівництво агентства 
З 2005 року НАСА керував Майкл Ґріффін. 20 січня 2009 року він пішов із посади у зв'язку з обранням нового президента США Барака Обами. З 22 січня 2009 року тимчасовим керівником НАСА призначений Кріс Сколезе. 15 липня того самого року Сенат конгресу США затвердив головою НАСА абшитованого генерал-майора морської піхоти, колишнього астронавта Чарльза Болдена.

1 вересня 2017 року президент Дональд Трамп запропонував Джима Брайденстайна на посаду директора НАСА, 19 квітня 2018 року той був затверджений Сенатом. Наступним адміністратором став Білл Нельсон, призначений президентом Джо Байденом з 3 травня 2021 року[28].

Нагороди НАСА
У нагороджувальній системі агентства медалі НАСА посідають гідне місце. Відзнака існує в 16 номінаціях: від медалі, якою нагороджують астронавтів за перший космічний політ, до медалі для справжніх лідерів в інженерній чи технологічній галузі. Нагороди НАСА в табелі авторитетності випереджає лише космічна Медаль пошани Конгресу США.

Медаль НАСА «За видатні наукові заслуги» — заснована 1991 року для цивільних співробітників організації та військових пілотів.

Факти 
Згідно з планами НАСА, в агентства, вдруге в історії, протягом п'яти років не буде жодного пілотованого космічного корабля: шаттли припинили польоти у 2011 році, а поява нового корабля «Оріон» з ракетою-носієм «Арес» планувалося лише на 2017 рік, а згодом вирішили запустити КК Crew Dragon SpaceX у 2019 році.
З народжених в Україні та нащадків вихідців з України відомо ряд діячів космічної галузі США: Ігор Богачевський, Богдан-Тарас Гнатюк, Теодор Костюк, Михайло Яримович, Богдан Беймук, Керол Бобко, Роберта Лінн Бондар, Брюс Едвард Мельник, Джудіт Рєзнік, Гайдемарі Стефанишин-Пайпер та інші.
Цитати про НАСА 
	Дехто сприймає HACA як таку собі ширму для грандіозних планів виведення військової техніки в навколоземний простір, хоча така зброя на орбіті в багатьох ситуаціях є легкою мішенню[29].	
— Карл Саган, Блакитна цятка. Космічне майбутнє людства.

Див. також
Астрофізична інформаційна система НАСА
11365 NASA — астероїд, названий на честь агентства.
Дорж Бату
Посилання

Вікісховище має мультимедійні дані за темою: NASA
(англ.) Офіційна сторінка космічного центру ім. Кеннеді
(англ.) NASA TV — телебачення НАСА.
(англ.) Image Galleries
Примітки
↓ Показувати повністю

 USA.gov
 Federal Register — Washington, D.C.: Office of the Federal Register, 1936. — ISSN 0097-6326; 2167-2520; 1065-5042; 1551-1413
 https://www.govinfo.gov/content/pkg/STATUTE-72/pdf/STATUTE-72-Pg426-2.pdf
 Oxford Reference — OUP. — ISBN 978-0-19-960586-6
 GovInfo — 2016.
 Архів преси XX століття — 1908.
 Museum of Modern Art online collection
 https://orcid.org/members/001G000001rjqHcIAI-nasa
 https://web.archive.org/web/20231020113811/https://orcid.org/members
 http://www.iafastro.org/membership/
 https://www.iadc-home.org/member_agencies_list
 https://www.ogc.org/ogc/members
 https://web.archive.org/web/20240112184553/https://datacite.org/members/
 https://nexss.info/about/about-nexss/
 admin (10 листопада 2024). Астронавт NASA показав знімок Землі, зроблений на висоті 400 кілометрів. Новини Ю (рос.). Процитовано 10 листопада 2024.
 «NASA Is About to Create The Coldest Temperature in The Universe, Using Lasers in Space» [Архівовано 24 травня 2018 у Wayback Machine.] Science Alert, May 21, 2018
 NASA Ames, UC Berkeley to build $2 billion space center in Silicon Valley. // By John Loeffler published October 21, 2023
 NASA збудує у Кремнієвій долині космічний центр. 23.10.2023, 18:53
 NASA names chief of UFO research; panel sees no alien evidence. // By Joey Roulette. September 14, 2023, 10:41 PM GMT+3
 У NASA призначили керівника дослідження НЛО. 15.09.2023, 21:54
 Unidentified Anomalous Phenomena Independent Study Report. September 14, 2023
 NASA Announces Launch Service for Arctic Warming Experiment. Aug 14, 2023
 NASA оголошує про запуск служби для експерименту з потеплінням Арктики. 15.08.2023
 NASA запустить безкоштовну стрімінгову платформу з трансляціями подій. // Автор:Svitlana Anisimova. 07.08.2023
 Молоді інженери з Дніпра перемогли у конкурсі NASA. 30.01.2021, 16:23
 Українська команда перемогла на міжнародному хакатоні NASA. 17.01.2025, 21:49
 NASA вперше втратила зв’язок з МКС через несподіване відключення електроенергії. // By Anna Nevolina. 30.07.2023
 Bartels, Meghan (19 березня 2021). President Biden nominates Bill Nelson to serve as NASA chief. space.com. Архів оригіналу за 7 вересня 2022. Процитовано 6 вересня 2022.
 Саган Карл. Блакитна цятка. Космічне майбутнє людства. — Харків: КСД, 2023 рік — 320 с. — ISBN 978-617-12-9893-4
[1]

[показати]пор
Національні космічні агентства
Інтернет-ресурси
Переломний момент. Частина 1. Фільм NASA
* Китайський, Американський космос, життя на екзопланеті, Дозаправка прямо в космосі
[показати]пор
НАСА
[показати]
Основні космічні місії та програми НАСА
Перегляд цього шаблону  У соціальних мережах
Instagram · Facebook · Google+ · Сабреддіт (англ.) · Twitter · X topic
Аудіо, відео(ігри), фото та мистецтво	
Вікісховище · C-SPAN · Flickr · SoundCloud · YouTube
Про аудіо, відео(ігри), фото та мистецтво	
Comic Vine · Discogs · Internet Movie Database · MusicBrainz · Музей Нової Зеландії Те Папа Тонгарева · Музей сучасного мистецтва (Нью-Йорк)
Література та бібліографія	
Biodiversity Heritage Library · Goodreads · Internet Speculative Fiction Database · LibraryThing · Online Books Page · Open Library · Open Library · Open Library · Open Library · openMLOL.it · Архів преси XX століття · Бібліотека Александера Тернбулла · Проєкт Гутенберг
Тематичні сайти	
SNAC · Google Новини · LinkedIn · Quora · Quora · Zhihu
Словники та енциклопедії	
Большая российская энциклопедия · Велика данська енциклопедія · Велика норвезька енциклопедія · Хорватська енциклопедія · Шведська національна енциклопедія · BabelNet · Brockhaus Enzyklopädie · De Agostini · Encyclopédie Larousse · Encyclopedia Treccani · Encyclopædia Britannica · Encyclopædia Universalis · NicoNicoPedia · Proleksis Encyclopedia
Довідкові видання	
Музей науки (Лондон) · Google Doodle · KBpedia · SNAC · UK Parliament thesaurus · WordNet · Fandom (англ.) · Fandom (англ.) · Fandom (англ.) · Fandom (англ.) · вікі Fandom (англ.) · RationalWiki
Нормативний контроль	
BanQ: 0000051069 · BIBSYS: 7052330 · BLBNB: 000260377 · BNE: XX148293 · BNF: 11868484t · CiNii: DA0256551X · ERRR: a11312944 · FAST: 528469 · Freebase: /m/05f4p · GND: 2294-9 · ISNI: 0000000449071619 · J9U: 987007269257605171 · KRNLK: KAB202010532 · LCCN: n78087581 · LIBRIS: tr575x0c3lsp568 · LIH: LNB:V*159892425;=Bf · LNB: 000175514 · MAK: 9810674906905606 · N6I: vtls001226593 · NCF: ncf10114878 · NDL: 00276299 · NKC: kn20010711417 · NLA: 1686290 · NLI: 000134189 · NLP: a0000002349136 · NSK: 000537106 · NUKAT: n97045968 · PTBNP: 385891 · RERO: A000167406 · SELIBR: 123881 · SHARE: 13277 · SKMASNL: vtls004688314 · SUDOC: 027773299 · UIY: 000048422 · ULAN: 500265440 · VIAF: 146202023


Космонавтика	Це незавершена стаття з космонавтики.
Ви можете допомогти проєкту, виправивши або дописавши її.
 admin (25 серпня 2024). NASA поверне космічний корабель Starliner без його астронавтів. SUMYTODAY (укр.). Процитовано 25 серпня 2024.
""")

messages = []
while True:
    inp = input()
    messages.append({
        "role" : "user",
        "content": inp
    })
    res = execute_chat(messages)
    print("\n### RESPONSE\n{data}\n".format(data=res[-1]["content"]))
    for message in res:
        messages.append(message)
